# CoarseScaleFillPatternIdParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CoarseScaleFillPatternIdParam Property
ParameterTypeId Class See Also
---
"Coarse Scale Fill Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CoarseScaleFillPatternIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoarseScaleFillPatternIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CoarseScaleFillPatternIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace